#include <iostream>
#include "Library.h"
#include"Functions.h"

using namespace std;

int main() {

	system("chcp 1251");
	int count = 0;

	printf("Сколько книг вы хотите ввести: ");
	scanf_s("%d",&count);

	Library* books = new Library[count];

	printf("Работа метода Set:\n");
	Write(books,count);

	printf("Работа метода Show:\n");
	cout << "---------------------------------------------------" << endl;
	cout << "|                 Каталог библиотеки              |" << endl;
	cout << "|-------------------------------------------------|" << endl;
	cout << "| Автор книги |  Название  | Год выпуска | Группа |" << endl;
	cout << "|-------------------------------------------------|" << endl;
	Print(books, count);
	cout << "|-------------------------------------------------|" << endl;
	cout << "| Примечание: Х - художественная литература;      |" << endl;
	cout << "| У - учебная литература; С - справочная литера - |" << endl;
	cout << "| тура                                            |" << endl;
	cout << "---------------------------------------------------" << endl;

	printf("Работа метода Get and Show:\n");
	cout << "---------------------------------------------------" << endl;
	cout << "|                 Каталог библиотеки              |" << endl;
	cout << "|-------------------------------------------------|" << endl;
	cout << "| Автор книги |  Название  | Год выпуска | Группа |" << endl;
	cout << "|-------------------------------------------------|" << endl;
	Print_and_Get(books,count);
	cout << "|-------------------------------------------------|" << endl;
	cout << "| Примечание: Х - художественная литература;      |" << endl;
	cout << "| У - учебная литература; С - справочная литера - |" << endl;
	cout << "| тура                                            |" << endl;
	cout << "---------------------------------------------------" << endl;


	return 0;
}