#define _CRT_SECURE_NO_WARNINGS
#include <iostream>
#include <stdio.h>

int main()
{
	system("chcp 1251");
	system("cls");

	char surname1[10], surname2[10], surname3[10] ; //Объявляем переменные
	char name1[10], name2[10], name3[10];
	int year1, year2, year3;
	char group1, group2, group3;

	printf("1.Введите такие параметры - автора книги, название, год выпуска и группу:"); //Ввод двнных
	scanf("%s %s %i %c", surname1, name1, &year1, &group1);
	printf("2.Введите такие параметры - автора книги, название, год выпуска и группу:");
	scanf("%s %s %i %c", surname2, name2, &year2, &group2);
	printf("3.Введите такие параметры - автора книги, название, год выпуска и группу:");
	scanf("%s %s %i %c", surname3, name3, &year3, &group3);
	printf("\n");

	printf("-----------------------------------------------------\n"); //Вывод таблицы
	printf("| Каталог библиотеки                                |\n");
	printf("|---------------------------------------------------|\n");
	printf("| Автор книги |   Название   | Год выпуска | Группа |\n");
	printf("|-------------|--------------|-------------|--------|\n");

	printf("| %-11s | %-12s | %-11i | %-6c |\n",surname1, name1, year1, group1); //Вывод данных в таблице
	printf("| %-11s | %-12s | %-11i | %-6c |\n", surname2, name2, year2, group2);
	printf("| %-11s | %-12s | %-11i | %-6c |\n", surname3, name3, year3, group3);

	printf("|---------------------------------------------------|\n"); //Вывод примечаний
	printf("| Примечание: Х - художественная литература;        |\n");
	printf("| У - учебная литература; С - справочная литература |\n");
	printf("-----------------------------------------------------\n");
}